---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SpecTypeId..::..String Properties
SpecTypeId..::..String Class See Also Send Feedback
---

The SpecTypeId..::..String type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | MultilineText | Multiline Text, in discipline Common. |
|  | Text | Text, in discipline Common. |
|  | Url | URL, in discipline Common. |

# See Also

SpecTypeId..::..String Class

Autodesk.Revit.DB Namespace